assignments/cylinder/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// ************************************************************************* //

convertToMeters 1;

// ============================================================
// Geometry parameters
// ============================================================

// Cylinder diameter and radius
D              1.0;
R              #calc "0.5 * $D";

// Radius of the intermediate circular ring around the cylinder
Rring          #calc "6.0 * $D";

// Distances from cylinder centre to far-field boundaries
LInlet         20.0;
LOutlet        40.0;
LTopBottom     20.0;

// Spanwise thickness for quasi-2D mesh
zMin           -0.5;
zMax            0.5;

// Useful negative values
minusR         #calc "-1.0 * $R";
minusRring     #calc "-1.0 * $Rring";

// Useful 45-degree coordinates
Rc45           #calc "$R / sqrt(2.0)";
Rring45        #calc "$Rring / sqrt(2.0)";

minusRc45      #calc "-1.0 * $Rc45";
minusRring45   #calc "-1.0 * $Rring45";

// Boundary coordinates
xInlet         #calc "-1.0 * $LInlet";
xOutlet        $LOutlet;
yTop           $LTopBottom;
yBottom        #calc "-1.0 * $LTopBottom";


// ============================================================
// Cell numbers
// ============================================================

nRadCyl        20;
nTheta45       10;
nUpstream      15;
nDownstream    20;
nTopAndBottom  15;
nZ             1;


// ============================================================
// Adjacent-cell expansion ratios
// q means: next cell size / previous cell size
// ============================================================

qRadial        1.1;
qTheta45       1.00;
qUpstream      1.1;
qDownstream    1.1;
qTopBottom     1.1;
qZ             1.00;


// ============================================================
// Values used by simpleGrading
// simpleGrading uses: last cell size / first cell size
// Therefore: G = q^(N - 1)
// ============================================================

GRadial        #calc "pow($qRadial, $nRadCyl - 1)";
GRadialInv     #calc "pow($qRadial, -1.0 * ($nRadCyl - 1))";

GTheta45       #calc "pow($qTheta45, $nTheta45 - 1)";
GTheta45Inv    #calc "pow($qTheta45, -1.0 * ($nTheta45 - 1))";

GUpstream      #calc "pow($qUpstream, $nUpstream - 1)";
GUpstreamInv   #calc "pow($qUpstream, -1.0 * ($nUpstream - 1))";

GDownstream    #calc "pow($qDownstream, $nDownstream - 1)";
GDownstreamInv #calc "pow($qDownstream, -1.0 * ($nDownstream - 1))";

GTopBottom     #calc "pow($qTopBottom, $nTopAndBottom - 1)";
GTopBottomInv  #calc "pow($qTopBottom, -1.0 * ($nTopAndBottom - 1))";

GZ             #calc "pow($qZ, $nZ - 1)";
GZInv          #calc "pow($qZ, -1.0 * ($nZ - 1))";

// ============================================================
// Vertices
// ============================================================

vertices
(
    // ============================================================
    // z = zMin, upper half
    // ============================================================

    ( $R        0          $zMin)  // 0
    ( $Rring    0          $zMin)  // 1
    ( $xOutlet  0          $zMin)  // 2
    ( $xOutlet  $Rring45   $zMin)  // 3
    ( $Rring45  $Rring45   $zMin)  // 4
    ( $Rc45     $Rc45      $zMin)  // 5
    ( $xOutlet  $yTop      $zMin)  // 6
    ( $Rring45  $yTop      $zMin)  // 7
    ( 0         $yTop      $zMin)  // 8
    ( 0         $Rring     $zMin)  // 9
    ( 0         $R         $zMin)  // 10
    ($minusR        0          $zMin)  // 11
    ($minusRring    0          $zMin)  // 12
    ( $xInlet   0          $zMin)  // 13
    ( $xInlet   $Rring45   $zMin)  // 14
    ($minusRring45  $Rring45   $zMin)  // 15
    ($minusRc45     $Rc45      $zMin)  // 16
    ( $xInlet   $yTop      $zMin)  // 17
    ($minusRring45  $yTop      $zMin)  // 18


    // ============================================================
    // z = zMax, upper half
    // ============================================================

    ( $R        0          $zMax)  // 19
    ( $Rring    0          $zMax)  // 20
    ( $xOutlet  0          $zMax)  // 21
    ( $xOutlet  $Rring45   $zMax)  // 22
    ( $Rring45  $Rring45   $zMax)  // 23
    ( $Rc45     $Rc45      $zMax)  // 24
    ( $xOutlet  $yTop      $zMax)  // 25
    ( $Rring45  $yTop      $zMax)  // 26
    ( 0         $yTop      $zMax)  // 27
    ( 0         $Rring     $zMax)  // 28
    ( 0         $R         $zMax)  // 29
    ($minusR        0          $zMax)  // 30
    ($minusRring    0          $zMax)  // 31
    ( $xInlet   0          $zMax)  // 32
    ( $xInlet   $Rring45   $zMax)  // 33
    ($minusRring45  $Rring45   $zMax)  // 34
    ($minusRc45     $Rc45      $zMax)  // 35
    ( $xInlet   $yTop      $zMax)  // 36
    ($minusRring45  $yTop      $zMax)  // 37


    // ============================================================
    // z = zMin, lower half
    // ============================================================

    ( $xOutlet  $minusRring45  $zMin)  // 38
    ( $Rring45  $minusRring45  $zMin)  // 39
    ( $Rc45     $minusRc45     $zMin)  // 40
    ( $xOutlet  $yBottom   $zMin)  // 41
    ( $Rring45  $yBottom   $zMin)  // 42
    ( 0         $yBottom   $zMin)  // 43
    ( 0        $minusRring     $zMin)  // 44
    ( 0        $minusR         $zMin)  // 45
    ( $xInlet  $minusRring45   $zMin)  // 46
    ($minusRring45 $minusRring45   $zMin)  // 47
    ($minusRc45    $minusRc45      $zMin)  // 48
    ( $xInlet   $yBottom   $zMin)  // 49
    ($minusRring45  $yBottom   $zMin)  // 50


    // ============================================================
    // z = zMax, lower half
    // ============================================================

    ( $xOutlet  $minusRring45  $zMax)  // 51
    ( $Rring45  $minusRring45  $zMax)  // 52
    ( $Rc45     $minusRc45     $zMax)  // 53
    ( $xOutlet  $yBottom   $zMax)  // 54
    ( $Rring45  $yBottom   $zMax)  // 55
    ( 0         $yBottom   $zMax)  // 56
    ( 0        $minusRring     $zMax)  // 57
    ( 0        $minusR         $zMax)  // 58
    ( $xInlet  $minusRring45   $zMax)  // 59
    ($minusRring45 $minusRring45   $zMax)  // 60
    ($minusRc45    $minusRc45      $zMax)  // 61
    ( $xInlet   $yBottom   $zMax)  // 62
    ($minusRring45  $yBottom   $zMax)  // 63
);


// ============================================================
// Blocks
// ============================================================

blocks
(
    // ============================================================
    // Upper-right quadrant
    // ============================================================

    hex (5 4 9 10 24 23 28 29)
        ($nRadCyl $nTheta45 $nZ)
        simpleGrading ($GRadial $GTheta45 $GZ)

    hex (0 1 4 5 19 20 23 24)
        ($nRadCyl $nTheta45 $nZ)
        simpleGrading ($GRadial $GTheta45 $GZ)

    hex (1 2 3 4 20 21 22 23)
        ($nDownstream $nTheta45 $nZ)
        simpleGrading ($GDownstream $GTheta45 $GZ)

    hex (4 3 6 7 23 22 25 26)
        ($nDownstream $nTopAndBottom $nZ)
        simpleGrading ($GDownstream $GTopBottom $GZ)

    hex (9 4 7 8 28 23 26 27)
        ($nTheta45 $nTopAndBottom $nZ)
        simpleGrading ($GTheta45 $GTopBottom $GZ)


    // ============================================================
    // Upper-left quadrant
    // ============================================================

    hex (15 16 10 9 34 35 29 28)
        ($nRadCyl $nTheta45 $nZ)
        simpleGrading ($GRadialInv $GTheta45 $GZ)

    hex (12 11 16 15 31 30 35 34)
        ($nRadCyl $nTheta45 $nZ)
        simpleGrading ($GRadialInv $GTheta45 $GZ)

    hex (13 12 15 14 32 31 34 33)
        ($nUpstream $nTheta45 $nZ)
        simpleGrading ($GUpstreamInv $GTheta45 $GZ)

    hex (14 15 18 17 33 34 37 36)
        ($nUpstream $nTopAndBottom $nZ)
        simpleGrading ($GUpstreamInv $GTopBottom $GZ)

    hex (15 9 8 18 34 28 27 37)
        ($nTheta45 $nTopAndBottom $nZ)
        simpleGrading ($GTheta45 $GTopBottom $GZ)


    // ============================================================
    // Lower-right quadrant
    // ============================================================

    hex (45 44 39 40 58 57 52 53)
        ($nRadCyl $nTheta45 $nZ)
        simpleGrading ($GRadial $GTheta45 $GZ)

    hex (40 39 1 0 53 52 20 19)
        ($nRadCyl $nTheta45 $nZ)
        simpleGrading ($GRadial $GTheta45 $GZ)

    hex (39 38 2 1 52 51 21 20)
        ($nDownstream $nTheta45 $nZ)
        simpleGrading ($GDownstream $GTheta45 $GZ)

    hex (42 41 38 39 55 54 51 52)
        ($nDownstream $nTopAndBottom $nZ)
        simpleGrading ($GDownstream $GTopBottomInv $GZ)

    hex (43 42 39 44 56 55 52 57)
        ($nTheta45 $nTopAndBottom $nZ)
        simpleGrading ($GTheta45 $GTopBottomInv $GZ)


    // ============================================================
    // Lower-left quadrant
    // ============================================================

    hex (44 45 48 47 57 58 61 60)
        ($nRadCyl $nTheta45 $nZ)
        simpleGrading ($GRadialInv $GTheta45 $GZ)

    hex (47 48 11 12 60 61 30 31)
        ($nRadCyl $nTheta45 $nZ)
        simpleGrading ($GRadialInv $GTheta45 $GZ)

    hex (46 47 12 13 59 60 31 32)
        ($nUpstream $nTheta45 $nZ)
        simpleGrading ($GUpstreamInv $GTheta45 $GZ)

    hex (49 50 47 46 62 63 60 59)
        ($nUpstream $nTopAndBottom $nZ)
        simpleGrading ($GUpstreamInv $GTopBottomInv $GZ)

    hex (50 43 44 47 63 56 57 60)
        ($nTheta45 $nTopAndBottom $nZ)
        simpleGrading ($GTheta45 $GTopBottomInv $GZ)
);


// ============================================================
// Curved edges
// ============================================================

edges
(
    // ============================================================
    // Cylinder surface and inner ring, z = zMin
    // ============================================================

    // Upper-right quadrant
    arc 0 5 45.0 (0 0 1)
    arc 5 10 45.0 (0 0 1)
    arc 1 4 45.0 (0 0 1)
    arc 4 9 45.0 (0 0 1)

    // Upper-left quadrant
    arc 11 16 45.0 (0 0 -1)
    arc 16 10 45.0 (0 0 -1)
    arc 12 15 45.0 (0 0 -1)
    arc 15 9 45.0 (0 0 -1)

    // Lower-right quadrant
    arc 0 40 45.0 (0 0 -1)
    arc 40 45 45.0 (0 0 -1)
    arc 1 39 45.0 (0 0 -1)
    arc 39 44 45.0 (0 0 -1)

    // Lower-left quadrant
    arc 11 48 45.0 (0 0 1)
    arc 48 45 45.0 (0 0 1)
    arc 12 47 45.0 (0 0 1)
    arc 47 44 45.0 (0 0 1)


    // ============================================================
    // Cylinder surface and inner ring, z = zMax
    // ============================================================

    // Upper-right quadrant
    arc 19 24 45.0 (0 0 1)
    arc 24 29 45.0 (0 0 1)
    arc 20 23 45.0 (0 0 1)
    arc 23 28 45.0 (0 0 1)

    // Upper-left quadrant
    arc 30 35 45.0 (0 0 -1)
    arc 35 29 45.0 (0 0 -1)
    arc 31 34 45.0 (0 0 -1)
    arc 34 28 45.0 (0 0 -1)

    // Lower-right quadrant
    arc 19 53 45.0 (0 0 -1)
    arc 53 58 45.0 (0 0 -1)
    arc 20 52 45.0 (0 0 -1)
    arc 52 57 45.0 (0 0 -1)

    // Lower-left quadrant
    arc 30 61 45.0 (0 0 1)
    arc 61 58 45.0 (0 0 1)
    arc 31 60 45.0 (0 0 1)
    arc 60 57 45.0 (0 0 1)
);


// ============================================================
// Boundary patches
// ============================================================

defaultPatch
{
    type empty;
}

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (14 13 32 33)
            (17 14 33 36)
            (13 46 59 32)
            (46 49 62 59)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (2 3 22 21)
            (3 6 25 22)
            (38 2 21 51)
            (41 38 51 54)
        );
    }

    top
    {
        type symmetryPlane;
        faces
        (
            (7 8 27 26)
            (6 7 26 25)
            (8 18 37 27)
            (18 17 36 37)
        );
    }

    bottom
    {
        type symmetryPlane;
        faces
        (
            (43 42 55 56)
            (42 41 54 55)
            (50 43 56 63)
            (49 50 63 62)
        );
    }

    cylinder
    {
        type wall;
        faces
        (
            // Upper semi-cylinder
            (10 5 24 29)
            (5 0 19 24)
            (16 10 29 35)
            (11 16 35 30)

            // Lower semi-cylinder
            (40 45 58 53)
            (0 40 53 19)
            (45 48 61 58)
            (48 11 30 61)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
